# T17z17_03.py
"""Т17.3 Побудувати декоратор, який перевіряє, чи дорівнює кількість позиційних
         параметрів кількості ключових параметрів функції, що декорується.
         Якщо не дорівнює, то ініціює виключення. За допомогою декоратора
         розв’язати задачу: скласти підпрограму зі змінною кількістю параметрів
         для обчислення функції
               f(x1,...,xn,y1,...,yn)=(x1+1/y1)*...*(xn+1/yn).
         Оформивши xi як позиційні, а yi – як ключові параметри.
"""


def args_not_kwargs(fun):
    def _args_not_kwargs(*ar, **kw):
# виконати дії перед викликом реальної функції
        if len(ar) != len(kw):
            raise ValueError("Не співпадає кількість позиційних і ключових параметрів")
        res = fun(*ar, **kw)
# виконати дії після виклику функції
        return res
# повернути підфункцію
    return _args_not_kwargs


@args_not_kwargs
def f(*ar, **kw):
    p = 1
    for x, y in zip(ar, kw.values()):
        p *= x + 1 / y
    return p


print(f(1, 2, 4, y1=2, y3=3, y2=10))  # без помилок
print(f(1, 4, y1=2, y3=3, y2=10))     # з помилкою

input()
