# T17z17_01.py

"""Т17.1 Побудувати декоратор, який коригує результат функції,
         що повертає число, так, щоб цей результат завжди був більше 0.
         Виконати перевірку роботи декоратора для деякої функції f.
"""


def ge_zero(fun):
    def _ge_zero(*ar, **kw):
# виконати дії перед викликом реальної функції
        res = fun(*ar, **kw)
# виконати дії після виклику функції
        if res < 0:
            res = -res
        return res
# повернути підфункцію
    return _ge_zero


@ge_zero
def fx1(x):
    return x


@ge_zero
def fx3(x):
    return x*x*x


print('      x      |    fx1(x)     |       fx3(x)')
print('-------------|---------------|---------------')
for x in range(-10, 11):
    print('{:12.5f} | {:13.5e} | {:13.5g}'.format(x, fx1(x), fx3(x)))

input()
