x = float(input('x= '))
y = float(input('y= '))
square = str(input('Оберіть область, належність точки до якої ви бажаєте перевірити. '
                   'Доступні варіанти: а, б: '))
if square == 'а':
    if ((x - 1)**2 + (y - 2)**2 >= 9) and ((x - 1)**2 + (y - 2)**2 <= 16):
        print('\033[32m Ця точка належить заданій області: ', square)
        # \033[32m -- ANSI код, що фарбує текст у зелений.
        # Полегшує сприйняття відповіді програми з консолі.
    else:
        print('\033[31m Ця точка НЕ належить заданій області: ', square)
        # \033[31m -- ANSI код, що фарбує текст у червоний.
elif square == 'б':
    if -3 <= y <= 5 and -6 <= x <= 2:
        print('\033[32m Ця точка належить заданій області: ', square)
    else:
        print('\033[31m Ця точка НЕ належить заданій області: ', square)
else:
    print('\033[46m Ви не обрали область...')
# \033[46m -- блакитний колір фону
non_stop = input()
