a1 = float(input("Введіть перше число послідовності: "))
b1 = a1
print("Для закінчення набору послідовності введіть '0'.")
an = float(input("Введіть наступне число послідовності: "))
index = 1
index_hidden = 0
negative_existence = False
# Пояснення:
# Якщо перше введене числе є мінімальним, то воно отримає номер 1 за замовчуванням. (3 строка)
# Якщо в послідовності знайдеться менше за попереднє число, то звісно воно має збільшити свій номер на одиницю.
#                                                                                                       (25 - 27 строки)

# АЛЕ користувач може вводити не тільку спадну послідовність, а також зростаючу.
# І якщо користувач вирішить після зростаючого набору чисел ввести число менше за попереднє найменше, то нам треба
# якось дорахувати всі ті номера, що не рахувалися, коли а1
#                                           (де а1 приймає найменше значення на даний момент) не змінювало значення.

# Для цього я застосував index_hidden, який рахує кількість всіх чисел, (що є більшими за дане мінімальне значення і
# завдяки яким умова 25-ої строки не виконувалася і не збільшувала номер найменшого числа,) і додає її до номеру нового
#                                                                                       знайденного найменшого числа.

# На випадок, якщо користувач запише менше за дане найменше число після введення більших чисел ще раз, index_hidden
# скидує значення до нуля після додавання до index, щоб не при новому обчисленні не було помилки. (30 строка)
while an != 0:
    if a1 > an > 0:
        a1 = an
        index += 1
        if a1 == an:
            index = index + index_hidden
            index_hidden = 0
    else:
        index_hidden += 1


    if b1 < 0:
        negative_existence = True
    if an < 0 and negative_existence is False:
        b1 = an
        negative_existence = True
    if b1 < an < 0:
        b1 = an

    an = float(input("Введіть наступне число послідовності: "))

if negative_existence is True:
    print("Найменше натуральне число = {}, його номер = {}, найбільше від'ємне = {}".format(a1, index, b1))

if negative_existence is False:
    print("Найменше число = {}, його номер = {}, найбільше від'ємне не існує, бо не було введено від'ємних чисел."
          .format(a1, index))

non_stop = input()
